Smoking Pipe Tutorial/smoking_pipe_codedFixedValue/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (-0.015 -0.007 -0.105)
    ( 0.015 -0.007 -0.105)
    ( 0.015  0.033 -0.105)
    (-0.015  0.033 -0.105)
    (-0.015 -0.007  0.001)
    ( 0.015 -0.007  0.001)
    ( 0.015  0.033  0.001)
    (-0.015  0.033  0.001)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 50 140) simpleGrading (1 1 1)
);

boundary
(
    defaultFaces
    {
        type patch;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (0 1 5 4)
            (2 3 7 6)
            (1 2 6 5)
            (0 4 7 3)
        );
    }
);
