Smoking Pipe Tutorial/smoking_pipe_codedFixedValue/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    pFinal
    {
	$p;
	relTol		0;
    }
    UFinal
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }
}

PIMPLE
{
    pRefCell 0;
    pRefValue 0;
    nNonOrthogonalCorrectors 5;
    nCorrectors	3;
    nOuterCorrrects 3;
    consistent      yes;
    momentumPredictor yes;
    residualControl
    {
        p               
	{
		tolerance	1e-3;
		relTol		0;
	}
        U               
	{
		tolerance	1e-4;
		relTol		0;
	}
    }
}

relaxationFactors
{
    fields
    {
	p	0.3;
	pFinal	0.8;
    }
    equations
    {
        U               0.7;// 0.9 is more stable but 0.95 more convergent
	UFinal		0.8;
    }
}


// ************************************************************************* //
